#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

int main()
{
	int n = 9;
	//0 00000000 00000000000000000001001 
	float* pFLOAT = (float*)&n;
	printf("%d\n", n);
	printf("*pFLOAT的值为：%f\n", *pFLOAT);
	//(-1)^0 * 0.00000000000000000001001 * 2^(-127)

	*pFLOAT = 9.0;
	//9.0
	//1001.0
	//(-1)^0 * 1.001 * 2^3
	//0 10000010 00100000000000000000000
	printf("%d\n", n);
	//1091567616
	printf("*pFLOAT的值为：%f\n", *pFLOAT);
	return 0;
}
//32位浮点数，最高位是符号位，接着8位是指数E，剩下23位是有效数字M
//64位浮点数，最高位是符号位，接着11位是指数E，剩下52位是有效数字M

//int main()
//{
//	float f = 5.5;
//	//101.1
//	//(-1)^0 * 1.011 * 2^2
//	//S=0
//	//E=2
//	//M=1.001
//	//0100 0000 1011 0000 0000 0000 0000 0000
//	//0x40 b0 00 00
//	return 0;
//}

//int main()
//{
//	double f = 9.5;
//	//1001.1
//	//(-1)^0 * 1.0011 * 2^3
//	//S=0
//	//M=1.0011
//	//E=3
//	//0100 0000 0010 0011 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000
//	//0x40 23 00 00 00 00 00 00
//	return 0;
//}
